import { prepareScrollToSearch } from '../helper';

describe('Alex bug at 24.09.2024', () => {

  const srchend   = (`את השם יבא ויטול ?`);
  const srchstart = (`רביעית אפילו החובבים את הלימוד`);

  test('test_reproduce bug', () => {
    const result = prepareScrollToSearch(data, { srchstart, srchend }, true);
    expect(result).not.toBeNull();
  });
});

const data = (`<div>
<p>
שלישית, הוא מפחד, שלא יחמיץ ח"ו, מחמת העסק הזה. כי כבר קרו מקרים, שנטו מדרך התורה, בסבת העסק בקבלה. וא"כ הצרה הזאת, למה לי? ומי פתי יכניס את עצמו בסכנה, על לא דבר?
</p>
<p>
רביעית: אפילו החובבים את הלימוד הזה, אינם מתירים אותה, אלא לקדושים משרתי אל, ו"לא כל הרוצה ליטול את השם, יבא ויטול"?
</p>
<p>
חמישית, והוא העיקר: כי קיימא לן בכל ספק, אשר פוק חזי מאי עמא דבר, ועיני הרואות, שבני תורה שבדורי, כולם המה עמי בדעה אחת, ושומטים ידיהם מלימוד הנסתר, וגם מיעצים לשואליהם, שבלי שום פקפוק, מוטב ללמוד דף גמרא, במקום העסק הזה?
</p>
</div>`);
